      /TITLE Utility, Command
      *PARMS
      /copy qcpysrc,Hspec
      /copy qcpysrc,Dspec
      * ---------------------------------------------------------
      *
      *    Check for omitted parameters.
      *
     C                   eval      msgid = execcmd('chkrcdlck')
     C                   eval      *inLR = *on
