      * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *  EDIT POSTAL CODE.
      * * * * * * * * * * * * * * * * * * * * * * * * * * *
     CSR   $EDPSC        BEGSR
      *
     C                   CALL      'UT0170R'
     C                   PARM                    EDPSCD           10
     C                   PARM                    MSGID
     C                   PARM                    MSGDTA
      *
     CSR   #EDPSC        ENDSR
