      * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *  EDIT PHONE NUMBER.
      * * * * * * * * * * * * * * * * * * * * * * * * * * *
     CSR   $EDPHN        BEGSR
      *
     C                   CALL      'UT0160R'
     C                   PARM                    EDPHON           22
     C                   PARM                    MSGID
     C                   PARM                    MSGDTA
      *
     CSR   #EDPHN        ENDSR
