      * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *  RETRIEVE NETWORK ATTRIBUTES.
      * * * * * * * * * * * * * * * * * * * * * * * * * * *
     C     $NETA         BEGSR
      *
     C                   CALL      'UT0200C'
     C                   PARM                    SYSNAM            8
      *
     C     #NETA         ENDSR
