      * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *  Print DB Records.
      * * * * * * * * * * * * * * * * * * * * * * * * * * *
     CSR   $PrtDBrcds    BEGSR
      *
     C                   CALL      'UT1610R'
     C                   PARM                    SQLstm
      *
     CSR   #PrtDBrcds    ENDSR
