      * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *  API ERROR DATA STRUCTURE.
      * * * * * * * * * * * * * * * * * * * * * * * * * * *
     D                 DS
     D  APILEN                 1      4B 0 INZ(116)
     D  APIAVL                 5      8B 0 INZ(0)
     D  APIMID                 9     15
     D  APIRSV                16     16
     D  APIMDT                17    116
