      * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *  Standard RPG "H" specification.
      * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H dftactgrp(*no)
     H enbpfrcol(*full)
     H alwnull(*usrctl)
     H bnddir('TSBNDDIR')
     H option(*noxref: *srcstmt: *nodebugio)
