      * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *  Standard RPG "H" specification for SQL.
      * * * * * * * * * * * * * * * * * * * * * * * * * * *
     H bnddir('TSBNDDIR')
     H bnddir('QC2LE')
     H dftactgrp(*NO) enbpfrcol(*FULL)
     H alwnull(*USRCTL)
     H option(*NOXREF:*SRCSTMT:*NODEBUGIO)
