      * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *  Standard type definitions.
      * * * * * * * * * * * * * * * * * * * * * * * * * * *
     D PSSRerror       s                   like(StdInd) inz
