      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *  Copy: System Value prototypes
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * ---------------------------------------------------------
      *  RtvSysVal() - Retrieve system value.

     D RtvSysVal       pr          2080a   varying
     D  iSysval                            like(StdNam) const
