      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *  Pager Prototypes
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * ---------------------------------------------------------
      *  SndPgrMsg() -- Send pager message
      *
     D SndPgrMsg       PR
     D  pager                              like(StdNam) const
     D  msg                                like(StdStr) const
