      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *  Group Job prototypes.
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * ---------------------------------------------------------
      *  ChgGrp() -- Set group attributes.
      *
     D ChgGrpA         PR
     D  text                               like(StdTxt) const
