      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           *
      *  User DB prototypes.
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           *
      * ---------------------------------------------------------
      *  SltCtlUT() -- Select user type.
      *
     D SltCtlUT        PR                  like(dfnCtlUT)
     D  WPposto                            like(dfnWPposto) const
     D                                     options(*nopass)
