      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           *
      *  Agency DB prototypes.
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           *
      * ---------------------------------------------------------
      * AgyChkDig() -- Determine agency check digit.
      *
     D AgyChkDig       PR                  like(StdInt)
     D   P_agyn                            like(dfnAMagyn) const
