      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           *
      *  Resort Area DB prototypes.
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           *
      * ---------------------------------------------------------
      *  RtvCtlra() - Retrieve resort area code record
      *
     D RtvCtlra        PR                  like(DFNctlra)
     D  RtvCtlRAcde                        like(dfnRArarcde) value
     D  RtvCtlRAdst                        like(dfnRAdest  ) value
