      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           *
      *  Association DB prototypes.
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *           *
      * ---------------------------------------------------------
      *  SltCtlAS() -- Select association.
      *
     D SltCtlAS        PR                  like(dfnCtlAS)
     D  WPposto                            like(dfnWPposto) const
     D                                     options(*nopass)
